using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Dalamud.Data
{
    class CNWorld
    {
        public static Dictionary<uint, uint> WorldList = new()
        {
            //陆行鸟
            {1042,101}, //拉诺西亚
            {1044,101}, //幻影群岛
            {1081,101}, //神意之地
            {1060,101}, //萌芽池
            {1167,101}, //红玉海
            {1173,101}, //宇宙和音
            {1174,101}, //沃仙曦染
            {1175,101},          //晨曦王座

            //莫古力
            {1170,102}, //潮风亭
            {1171,102}, //神拳痕
            {1172,102}, //白银乡
            {1076,102}, //白金幻象
            {1113,102}, //旅人栈桥
            {1121,102}, //拂晓之间
            {1166,102}, //龙巢神殿
            {1176,102},          //梦羽宝境

            //猫小胖
            {1043,103}, //紫水栈桥
            {1069,103}, //延夏
            {1106,103}, //静语庄园
            {1045,103}, //摩杜纳
            {1177,103}, //海猫茶屋
            {1178,103}, //柔风海湾
            {1179,103},          //琥珀原

            //豆豆柴
            {1074,104}, //水晶塔
            {1050,104}, //银泪湖
            {1048,104}, //太阳海岸
            {1057,104}, //伊修加德
            {1056,104},          //红茶川

        };

        public static Dictionary<uint,string> ServerList = new()
        {
            {101, "陆行鸟"},
            {102, "莫古力"},
            {103, "猫小胖"},
            {201, "豆豆柴"},

        };
    }
}
